//题目：将一个正整数分解质因数。例如：输入 90,打印出 90=2*3*3*5。
//程序分析：对n进行分解质因数，应先找到一个最小的质数k，然后按下述步骤完成：

#include <stdio.h>
int main(){
	int n;
	//定义两个整数变量：	
	//n：用户输入的整数。	
	//i：用于遍历可能的质因数。
	printf("请输入整数：");
	scanf("%d",&n);
	printf("%d=",n);
	for(int i=2;i<=n;i++){//i 从 2 开始，依次尝试作为 n 的因数。只要 i <= n，就继续循环。
		while(n%i==0){//如果 n 能被 i 整除，说明 i 是 n 的一个质因数。
			printf("%d",i);//进入 while 循环，打印 i，			
			n=n/i;//然后让 n 除以 i
			if(n!=1){//只要 n 还没被完全分解（即 n != 1），就在因子之间输出 "*"，保证输出格式正确。
				printf("*");
			}
		}
	}
	printf("\n");//让输出换行，保持美观。
	return 0;//表示程序正常结束。
}
